Repository: fossabot/hoe-manns
Catalog: docbook/*/Feedback.po
Languages: de_de

source: We Need Feedback!
de_de: Wir benötigen Feedback!

source: <primary>Feedback</primary> <secondary>Contact information</secondary>
de_de: <primary>Rückmeldungen</primary> <secondary>Kontaktinformation</secondary>

source: I'm happy about feedback. You can send me an email: <link xlink:href="mailto:Sascha.Manns@directbox.com">Sascha.Manns@mailbox.org</link>.
de_de: Ich freue mich über Rückmeldungen. Sie können mir gerne eine Email schreiben: <link xlink:href="mailto:Sascha.Manns@directbox.com">Sascha.Manns@mailbox.org</link>.

source: <emphasis role="bold">Contact</emphasis>
de_de: <emphasis role="bold">Kontakt</emphasis>

source: Authors Blog: <link xlink:href="http://saigkill.tuxfamily.org">http://saigkill.tuxfamily.org</link>
de_de: Autorenblog: <link xlink:href="http://saigkill.tuxfamily.org">http://saigkill.tuxfamily.org</link>

source: <emphasis role="bold">Contribute</emphasis>
de_de: <emphasis role="bold">Unterstützen</emphasis>

source: Clone the code: <link xlink:href="https://git.launchpad.net/hoe-manns ">https://git.launchpad.net/hoe-manns </link>. Feel free to add new Tasks.
de_de: Klone den Code: <link xlink:href="https://git.launchpad.net/hoe-manns">https://git.launchpad.net/hoe-manns</link>. Fühlen Sie sich frei, neue Tasks hinzuzufügen.

source: File a bug: <link xlink:href="https://bugs.launchpad.net/hoe-manns">https://bugs.launchpad.net/hoe-manns</link>
de_de: Berichten Sie einen Bug: <link xlink:href="https://bugs.launchpad.net/hoe-manns">https://bugs.launchpad.net/hoe-manns</link>

source: File a feature request: <link xlink:href="https://blueprints.launchpad.net/hoe-manns">https://blueprints.launchpad.net/hoe-manns</link>
de_de: Schreiben Sie einen Feature Request:<link xlink:href="https://blueprints.launchpad.net/hoe-manns">https://blueprints.launchpad.net/hoe-manns</link>

source: Improve the Docs: <link xlink:href="https://git.launchpad.net/~sascha-manns-h/hoe-manns/+git/docbook">https://git.launchpad.net/~sascha-manns-h/hoe-manns/+git/docbook</link>
de_de: Verbessern Sie die Dokumentation:<link xlink:href="https://git.launchpad.net/~sascha-manns-h/hoe-manns/+git/docbook">https://git.launchpad.net/~sascha-manns-h/hoe-manns/+git/docbook</link>
