Repository: fossabot/hoe-manns
Catalog: docbook/*/hoe-manns.po
Languages: de_de

source: Introduction to &PRODUCT;
de_de: Einführung zu &PRODUCT;

source: &PRODUCT; is a extension of the <application>&rb;</application> projectsoftware <application>hoe</application> (see <link xlink:href="https://github.com/seattlerb/hoe" xmlns:xlink="http://www.w3.org/1999/xlink">https://github.com/seattlerb/hoe</link>.) It extends the standard <application>&rb;</application> tasks to some new useful tasks.
de_de: &PRODUCT; ist eine Erweiterung der <application>&rb;</application>-Projektsoftware <application>hoe</application> (Schauen Sie: <link xlink:href="https://github.com/seattlerb/hoe" xmlns:xlink="http://www.w3.org/1999/xlink">https://github.com/seattlerb/hoe</link>.) Es erweitert die Standard <application>&rb;</application> Tasks um ein paar neue, nützliche Tasks.

source: To use the software you will need a installed <application>&rb;</application> version (Higher or equal 2.2.0), <application>parseconfig</application>, <application>bundler-audit</application> and a installed and already configured <application>hoe</application>.
de_de: Um die Software zu benutzen, benötigen Sie ein installiertes <application>&rb;</application> in der Version 2.2.0 oder höher, <application>parseconfig</application>, <application>bundler-audit</application> und ein installiertes und konfiguriertes <application>hoe</application>.

source: For installing you have to type in your Shell/Console: <command>gem install hoe-manns</command>.
de_de: Zur Installation geben Sie in Ihrer Shell/Konsole folgendes ein: <command>gem install hoe-manns</command>.

source: How to use <productname>&PRODUCT;</productname> in your projects
de_de: Benutzung von <productname>&PRODUCT;</productname> in Ihren Projekten

source: First you have to open the <filename>Rakefile</filename> of your project and writes there near the <filename>Hoe.spec</filename> line:
de_de: Zuerst öffnen Sie das <filename>Rakefile</filename> Ihres Projektes und schreiben Sie in der Nähe der <filename>Hoe.spec</filename>:

source: Sure now you have to add <productname>&PRODUCT;</productname> as dependency in your <filename>Rakefile</filename> and generate a new <filename>Gemfile</filename> now. Then <productname>&PRODUCT;</productname> is ready to work.
de_de: Natürlich müssen sie <productname>&PRODUCT;</productname> als Abhängigkeit in Ihr <filename>Rakefile</filename> eintragen und ein neues <filename>Gemfile</filename> generieren. Dann ist <productname>&PRODUCT;</productname> einsatzbereit.

source: Usage
de_de: Benutzung

source: <productname>&PRODUCT;</productname> integrates some additional <application>Rake</application>-Taks as explained in the next table.
de_de: <productname>&PRODUCT;</productname> integriert einige zusätzliche <application>Rake</application>-Tasks wie hier erklärt.

source: The Rake Tasks
de_de: Die Rake Tasks

source: Effect
de_de: Effekt

source: generates a new <filename>Gemfile.lock</filename>
de_de: generiert eine neue <filename>Gemfile.lock</filename> Datei

source: downloads the actual security warnings from <application>bundle-audit</application> and checks possible problems by the dependencies.
de_de: lädt die aktuellen Sicherheitswarnungen für <application>bundle-audit</application> herunter und überprüft die Abhängigkeiten Ihres Projektes.

source: checks if a "<filename>pkg</filename>" directory is present, if then it will be deleted.
de_de: überprüft, ob ein "<filename>pkg</filename>" Verzeichnis vorhanden ist. Falls ja, wird es gelöscht.

source: it expects a branch "develop" and merges the new stuff into the master branch. Then it runs a rake <command>git:tag</command> and returns again into the develop branch.
de_de: Es erwartet einen "develop" branch und merged alles in den master Branch. Dann startet es <command>git:tag</command> und wechselt wieder in den develop branch.

source: checks the presence of a Pre-Gemspec (a generated file for test cases) and deletes them.
de_de: überprüft, ob eine Pre-Gemspec (für Testfälle generiert) vorhanden ist, und löscht Sie.

source: runs the task in that order: git:manifest, bundler:gemfile, bundler:gemfile_lock, gem:spec_remove, bundle_audit:run, copy_master.
de_de: startet die Tasks in der folgenen Reihe: git:manifest, bundler:gemfile, bundler:gemfile_lock, gem:spec_remove, bundle_audit:run, copy_master.

source: runs the tasks: send_email and clean_pkg
de_de: startet die Tasks: send_email und clean_pkg

source: Additional Information
de_de: Zusätzliche Informationen

source: The API-Dokumentation is placed there: <link xlink:href="http://www.rubydoc.info/gems/hoe-manns" xmlns:xlink="http://www.w3.org/1999/xlink">http://www.rubydoc.info/gems/hoe-manns</link>.
de_de: Die API-Dokumentation ist hier verfügbar: <link xlink:href="http://www.rubydoc.info/gems/hoe-manns" xmlns:xlink="http://www.w3.org/1999/xlink">http://www.rubydoc.info/gems/hoe-manns</link>.

source: You can place Bugreports there: <link xlink:href="https://bugs.launchpad.net/hoe-manns" xmlns:xlink="http://www.w3.org/1999/xlink">https://bugs.launchpad.net/hoe-manns</link>.
de_de: Sie können Bugreports hier berichten: <link xlink:href="https://bugs.launchpad.net/hoe-manns" xmlns:xlink="http://www.w3.org/1999/xlink">https://bugs.launchpad.net/hoe-manns</link>.

source: You can place Feature Requests there: <link xlink:href="https://blueprints.launchpad.net/hoe-manns" xmlns:xlink="http://www.w3.org/1999/xlink">https://blueprints.launchpad.net/hoe-manns</link>.
de_de: Feature Requests können hier eingereicht werden: <link xlink:href="https://blueprints.launchpad.net/hoe-manns" xmlns:xlink="http://www.w3.org/1999/xlink">https://blueprints.launchpad.net/hoe-manns</link>.

source: This software was developed and tested on a Linux system with RVM as Rubymanager. If anyone has any idea to make the software fit for other OS and Rubymanagers, then you can send a Pull-Request on Github.
de_de: Diese Software wurde auf einem Linux System entwickelt und getestet. Als Rubymanager kam RVM zum Einsatz. Falls Sie eine Idee haben, um die Software für andere OS und Rubymanager verfügbar zu machen, können Sie mir einen Pull-Request in Github senden.
