Repository: fossabot/hoe-manns
Catalog: docbook/*/Revision_History.po
Languages: de_de

source: Revision History
de_de: Versionsgeschichte

source: Removed update_workspace method description
de_de: Methode update_workspace wurde entfernt

source: Removed copy_manual description. Both methods a dropped upstream
de_de: Methode copy_manual wurde entfernt. Beide Methoden wurden upstream entfernt

source: Added Feedback Section
de_de: Bereich für Rückmeldungen eingerichtet

source: Beautifyed DocBook Code
de_de: DocBook Code verbessert

source: Updated dependencies
de_de: Abhängigkeiten aktualisiert

source: Updated Handbook
de_de: Handbuch aktualisiert

source: fixed HM-2: Simplify copy_wiki method (dropped)
de_de: gefixt HM-2: Vereinfache copy_wiki Methode (entfernt)

source: fixed HM-3: manns.rb (Code cleanup)
de_de: fixed HM-3: manns.rb (Code aufräumen)

source: removed pandoc dependency
de_de: Pandoc Abhängigkeit entfernt

source: Translation files synchronised with XML sources 0.0-0
de_de: Übersetzungsdateien synchronisiert mit XML Quellen 0.0-0
